# SPDX-FileCopyrightText: 2019 Emil Lundmark <emil@lndmrk.se>
# SPDX-License-Identifier: GPL-3.0-or-later
#+TITLE: lndmrk's Emacs Configuration
#+AUTHOR: Emil Lundmark

*** modus-theme

#+begin_src emacs-lisp
(use-package modus-themes
  :ensure t
  :custom
  (modus-themes-org-blocks 'gray-background)
  (modus-themes-common-palette-overrides
   '((border-mode-line-active unspecified)
     (border-mode-line-inactive unspecified)
     (bg-line-number-active unspecified)
     (bg-line-number-inactive unspecified)
     (fg-line-number-active fg-main)
     (fg-line-number-inactive fg-dim)
     (fg-region unspecified)))
  (modus-operandi-palette-overrides
   '((bg-main "#EDEDED")
     (bg-dim "#FAFAFA")
     (bg-active"#B5B5B5")
     (bg-inactive "#CFCFCF")
     (border "#929292")))
  (modus-vivendi-palette-overrides
   '((bg-main "#171717")
     (bg-dim "#2A2A2A")
     (bg-active"#5D5D5D")
     (bg-inactive "#3A3A3A")
     (border "#6E6E6E")))
  :config
  (load-theme 'modus-vivendi :no-confirm))
#+end_src

The =bg-main= color have been overridden to match my terminal background color.
Other background colors have been adjusted accordingly to retain the contrast
ratio.

| bg-main     |         | #FFFFFF | #EDEDED |
|-------------+---------+---------+---------|
| bg-dim      | #F2F2F2 |    1.12 |         |
| bg-active   | #C4C4C4 |    1.74 |         |
| bg-inactive | #E0E0E0 |    1.32 |         |
| border      | #9F9F9F |    2.65 |         |
|-------------+---------+---------+---------|
| bg-dim      | #FAFAFA |         |    1.12 |
| bg-active   | #B5B5B5 |         |    1.75 |
| bg-inactive | #CFCFCF |         |    1.33 |
| border      | #929292 |         |    2.66 |
#+tblfm: @2$3..@5$3='(modus-themes-contrast @1$3 $2);%0.2f::@6$4..@9$4='(modus-themes-contrast @1$4 $2);%0.2f

| bg-main     |         | #000000 | #171717 |
|-------------+---------+---------+---------|
| bg-dim      | #1E1E1E |    1.26 |         |
| bg-active   | #535353 |    2.73 |         |
| bg-inactive | #303030 |    1.59 |         |
| border      | #646464 |    3.55 |         |
|-------------+---------+---------+---------|
| bg-dim      | #2A2A2A |         |    1.25 |
| bg-active   | #5D5D5D |         |    2.72 |
| bg-inactive | #3A3A3A |         |    1.58 |
| border      | #6E6E6E |         |    3.52 |
#+tblfm: @2$3..@5$3='(modus-themes-contrast @1$3 $2);%0.2f::@6$4..@9$4='(modus-themes-contrast @1$4 $2);%0.2f

